---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.InteriorCategoriesEnabledInLargeView
source: html/0c61e6e2-df5d-d232-6a33-bdd397a2dbaa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.InteriorCategoriesEnabledInLargeView Property

Interior categories are enabled in a large view. Even though these objects may be obscured and invisible,
 they still have negative impact on performance.

## Syntax (C#)
```csharp
public static FailureDefinitionId InteriorCategoriesEnabledInLargeView { get; }
```